const a = [
  {
    q:
      '应当根据气象灾害防御的需要，建设应急移动气象灾害监测设施，健全应急监测队伍，完善气象灾害监测体系',
    qId: '1',
    correct: '1',
    a: [
      {
        aId: '1',
        atext: '县级以上地方人民政府 '
      },
      {
        aId: '2',
        atext: '省级气象主管机构'
      },
      { aId: '3', atext: '县级气象主管机构' },
      {
        aId: '4',
        atext: '县级以上气象主管机构'
      }
    ]
  },
  {
    q: '《气象灾害防御条例》是根据__制定的',
    qId: '2',
    correct: '2',
    a: [
      {
        aId: '1',
        atext: '《国家突发事件应对条例》 '
      },
      {
        aId: '2',
        atext: '《中华人民共和国气象法》'
      },
      {
        aId: '3',
        atext: '《中华人民共和国宪法》'
      },
      {
        aId: '4',
        atext: '《中华人民共和国灾害防御条例》'
      }
    ]
  },
  {
    q: '以下哪项不属于《气象灾害防御条例》所指的气象灾害____。',
    qId: '3',
    correct: '4',
    a: [
      {
        aId: '1',
        atext: '高温 '
      },
      {
        aId: '2',
        atext: '沙尘暴'
      },
      {
        aId: '3',
        atext: '干旱 '
      },
      {
        aId: '4',
        atext: '暴雨洪涝'
      }
    ]
  },
  {
    q:
      '____应当组织气象等有关部门对本行政区域内发生的气象灾害的种类、次数、强度和造成的损失等情况开展气象灾害普查，建立气象灾害数据库，按照气象灾害的种类进行气象灾害风险评估，并根据气象灾害分布情况和气象灾害风险评估结果，划定气象灾害风险区域。',
    qId: '4',
    correct: '1',
    a: [
      {
        aId: '1',
        atext: '县级以上地方人民政府'
      },
      {
        aId: '2',
        atext: '县级以上气象主管机构 '
      },
      {
        aId: '3',
        atext: '地方气象主管机构'
      },
      {
        aId: '4',
        atext: '地方人民政府'
      }
    ]
  },
  {
    q:
      '气象灾害应急预案启动后，各级气象主管机构应当组织所属的气象台站加强对气象灾害的监测和评估，启用应急移动气象灾害监测设施，开展____，及时向本级人民政府、有关部门报告灾害性天气实况、变化趋势和评估结果，为本级人民政府组织防御气象灾害提供决策依据。',
    qId: '5',
    correct: '4',
    a: [
      {
        aId: '1',
        atext: '短临气象服务'
      },
      {
        aId: '2',
        atext: '应急气象服务'
      },
      {
        aId: '3',
        atext: '气象风险评估'
      },
      {
        aId: '4',
        atext: '现场气象服务'
      }
    ]
  },
  {
    q: '____应当整合完善气象灾害监测信息网络，实现信息资源共享。',
    qId: '6',
    correct: '2',
    a: [
      {
        aId: '1',
        atext: '通讯部门'
      },
      {
        aId: '2',
        atext: '县级以上人民政府'
      },
      {
        aId: '3',
        atext: '信息中心'
      },
      {
        aId: '4',
        atext: '中国气象局'
      }
    ]
  },
  {
    q:
      '____根据风灾风险评估结果和预报的风力情况，与地方人民政府共同做好危险地带和防风能力不足的危房内居民的转移，安排其到安全避风场所避风。',
    qId: '7',
    correct: '1',
    a: [
      {
        aId: '1',
        atext: '防汛部门'
      },
      {
        aId: '2',
        atext: '住房城乡建设'
      },
      {
        aId: '3',
        atext: '安监部门'
      },
      {
        aId: '4',
        atext: '农业部门'
      }
    ]
  },
  {
    q:
      '国家气象灾害应急预案中气象灾害预警标准只有Ⅱ级、Ⅲ级和Ⅳ级的气象灾害是____。',
    qId: '8',
    correct: '1',
    a: [
      {
        aId: '1',
        atext: '寒潮、高温'
      },
      {
        aId: '2',
        atext: '沙尘暴、大雾'
      },
      {
        aId: '3',
        atext: '沙尘暴、高温'
      },
      {
        aId: '4',
        atext: '大雾、低温'
      }
    ]
  },
  {
    q:
      '《气象灾情收集上报调查和评估规定（2018）》中规定，____负责整理特别重大和重大突发气象事件的基本情况，如事件、地点、起因、伤亡损失和处置情况要逐一列出并进行分析，提出建议和对策。',
    qId: '9',
    correct: '2',
    a: [
      {
        aId: '1',
        atext: '公共服务中心'
      },
      {
        aId: '2',
        atext: '国家气象中心'
      },
      {
        aId: '3',
        atext: '国家气候中心'
      },
      {
        aId: '4',
        atext: '信息中心'
      }
    ]
  },
  {
    q:
      '地方各级气象主管机构应当会同城乡规划、国土资源等部门制定气象设施和气象探测环境保护专项规划，报本级人民政府批准后依法纳入____。',
    qId: '10',
    correct: '2',
    a: [
      {
        aId: '1',
        atext: '上级财政预算'
      },
      {
        aId: '2',
        atext: '城乡规划'
      },
      {
        aId: '3',
        atext: '同级财政预算'
      },
      {
        aId: '4',
        atext: '全民经济社会发展纲要'
      }
    ]
  },
  {
    q:
      '《气象灾害防御条例》规定，县级以上地方人民政府.有关部门应当根据气象灾害发生情况，依照____的规定及时采取应急处置措施；情况紧急时，及时动员、组织受到灾害威胁的人员转移、疏散，开展自救互救。',
    qId: '11',
    correct: '1',
    a: [
      {
        aId: '1',
        atext: '《中华人民共和国突发事件应对法》'
      },
      {
        aId: '2',
        atext: '本地气象灾害防御规划'
      },
      {
        aId: '3',
        atext: '《气象灾害防御条例》'
      },
      {
        aId: '4',
        atext: '本地气象灾害应急预案'
      }
    ]
  },
  {
    q:
      '根据《气象灾害防御条例》，各级气象主管机构及其所属的气象台站应当完善灾害性天气的预报系统，提高灾害性天气预报.警报的____和时效性。',
    qId: '12',
    correct: '2',
    a: [
      {
        aId: '1',
        atext: '覆盖面'
      },
      {
        aId: '2',
        atext: '准确率'
      },
      {
        aId: '3',
        atext: '针对性'
      },
      {
        aId: '4',
        atext: '提前量'
      }
    ]
  },
  {
    q:
      '根据《国家气象灾害应急预案》，高温.沙尘暴.雷电.大风.霜冻.大雾.霾等灾害由____启动相应的应急指挥机制或建立应急指挥机制负责处置工作。',
    qId: '13',
    correct: '3',
    a: [
      {
        aId: '1',
        atext: '国务院相关部门'
      },
      {
        aId: '2',
        atext: '省防汛抗旱指挥部'
      },
      {
        aId: '3',
        atext: '地方人民政府'
      },
      {
        aId: '4',
        atext: '省发展改革'
      }
    ]
  },
  {
    q:
      '根据《气象灾害防御条例》，发生跨省、自治区、直辖市大范围的气象灾害，并造成较大危害时，由____决定启动国家气象灾害应急预案。',
    qId: '14',
    correct: '3',
    a: [
      {
        aId: '1',
        atext: '中国气象局'
      },
      {
        aId: '2',
        atext: '国家防汛抗旱总指挥部'
      },
      {
        aId: '3',
        atext: '国务院'
      },
      {
        aId: '4',
        atext: '国家减灾委'
      }
    ]
  },
  {
    q:
      '根据《国家气象灾害应急预案》，各地区，各部门要按照有关规定向国务院报告____信息。',
    qId: '15',
    correct: '4',
    a: [
      {
        aId: '1',
        atext: '较大'
      },
      {
        aId: '2',
        atext: '重大'
      },
      {
        aId: '3',
        atext: '特别重大'
      },
      {
        aId: '4',
        atext: '重大级别以上'
      }
    ]
  },
  {
    q: '根据《国家气象灾害应急预案》，需要发布Ⅲ级预警的气象灾害有____个。',
    qId: '16',
    correct: '4',
    a: [
      {
        aId: '1',
        atext: '12.0 '
      },
      {
        aId: '2',
        atext: '9.0'
      },
      {
        aId: '3',
        atext: '10.0'
      },
      {
        aId: '4',
        atext: '11.0'
      }
    ]
  },
  {
    q: '关于干旱预警以下表述正确的是____。',
    qId: '17',
    correct: '2',
    a: [
      {
        aId: '1',
        atext:
          '《国家气象灾害应急预案》中干旱的预警分为四级，干旱气象灾害预警信号也对应的分为四级'
      },
      {
        aId: '2',
        atext:
          '《国家气象灾害应急预案》中干旱的预警分为三级，干旱气象灾害预警信号分为两级'
      },
      {
        aId: '3',
        atext:
          '《国家气象灾害应急预案》中干旱的预警分为三级，干旱气象灾害预警信号也对应的分为三级'
      },
      {
        aId: '4',
        atext:
          '《国家气象灾害应急预案》中干旱的预警分为两级，干旱气象灾害预警信号也对应的分为两级'
      }
    ]
  },
  {
    q:
      '《气象灾害防御条例》规定：大风（沙尘暴）、____多发区域的地方各级人民政府、有关部门应当加强防护林和紧急避难场所等建设，并定期组织开展建（构）筑物防风避险的监督检查。',
    qId: '18',
    correct: '3',
    a: [
      {
        aId: '1',
        atext: '寒潮'
      },
      {
        aId: '2',
        atext: '暴雨'
      },
      {
        aId: '3',
        atext: '龙卷风'
      },
      {
        aId: '4',
        atext: '台风'
      }
    ]
  },
  {
    q:
      '《气象灾害防御条例》规定：气象灾害防御工作涉及两个以上行政区域的，____、有关部门应当建立联防制度，加强信息沟通和监督检查。',
    qId: '19',
    correct: '1',
    a: [
      {
        aId: '1',
        atext: '有关地方人民政府'
      },
      {
        aId: '2',
        atext: '有关气象主管机构'
      },
      {
        aId: '3',
        atext: '当地应急管理机构'
      },
      {
        aId: '4',
        atext: '气象灾害防御指挥部'
      }
    ]
  },
  {
    q:
      '2020年，建成____、核心技术先进、业务平台智能、人才队伍强大、业务管理科学”的现代气象预报业务体系，气象预报业务整体实力达到同期世界先进水平。',
    qId: '20',
    correct: '2',
    a: [
      {
        aId: '1',
        atext: '预报预警精细化'
      },
      {
        aId: '2',
        atext: '预报预测精准'
      },
      {
        aId: '3',
        atext: '管理队伍人性化'
      },
      {
        aId: '4',
        atext: '预报队伍强大'
      }
    ]
  },
  {
    q: '翻斗式降水传感器其输出的信号是_____。',
    qId: '21',
    correct: '2',
    a: [
      {
        aId: '1',
        atext: '并行信号'
      },
      {
        aId: '2',
        atext: '开关信号'
      },
      {
        aId: '3',
        atext: '频率信号'
      },
      {
        aId: '4',
        atext: '串行信号'
      },
      {
        aId: '5',
        atext: '模拟信号'
      }
    ]
  },
  {
    q:
      '目前自动气象站使用的风速传感器主要有EL15-1C和ZQZ-TFS两种型号。其中ZQZ-TFS型风速传感器使用的是电磁感应技术，根据其原理，当某自动站观测到有大风时，此风速传感器每秒钟至少要转多少圈？',
    qId: '22',
    correct: '1',
    a: [
      {
        aId: '1',
        atext: '10'
      },
      {
        aId: '2',
        atext: '7'
      },
      {
        aId: '3',
        atext: '8'
      },
      {
        aId: '4',
        atext: '9'
      }
    ]
  },
  {
    q: '现行各种能见度仪的波段多在____之间。',
    qId: '23',
    correct: '3',
    a: [
      {
        aId: '1',
        atext: '200-1100'
      },
      {
        aId: '2',
        atext: '600-1200'
      },
      {
        aId: '3',
        atext: '300-1100'
      }
    ]
  },
  {
    q:
      '对正点非人工观测发报时次或加密z文件，未能正常编报z文件和发送时，可使用____功能进行补发z文件并发送。',
    qId: '24',
    correct: '3',
    a: [
      {
        aId: '1',
        atext: '补发'
      },
      {
        aId: '2',
        atext: '人工订正'
      },
      {
        aId: '3',
        atext: '上传文件补调'
      },
      {
        aId: '4',
        atext: '历史数据下载'
      }
    ]
  },
  {
    q: '在非定时观测时次能见度传感器故障时，能见度项处理如下____。',
    qId: '25',
    correct: '4',
    a: [
      {
        aId: '1',
        atext: '只输入CW段'
      },
      {
        aId: '2',
        atext: '同时输入CW段和VV段里面的十分钟平均能见度'
      },
      {
        aId: '3',
        atext: '只输入VV段里面的十分钟平均能见度'
      },
      {
        aId: '4',
        atext: '全部缺测'
      }
    ]
  },
  {
    q: '自动气象站发现故障时______。',
    qId: '26',
    correct: '3',
    a: [
      {
        aId: '1',
        atext: '应当关闭总闸'
      },
      {
        aId: '2',
        atext: '应当立即关闭计算机'
      },
      {
        aId: '3',
        atext: '除非危及人身安全或设备财产，一般不要关电源'
      },
      {
        aId: '4',
        atext: '应当立即关闭电源'
      }
    ]
  },
  {
    q: 'E-601B型蒸发器的防水圈口缘低于蒸发桶口_____。',
    qId: '27',
    correct: '2',
    a: [
      {
        aId: '1',
        atext: '7～8cm'
      },
      {
        aId: '2',
        atext: '5～6cm'
      },
      {
        aId: '3',
        atext: '3～5cm'
      },
      {
        aId: '4',
        atext: '8～10cm'
      }
    ]
  },
  {
    q: '新型自动气象站风传感器供电电压为____。',
    qId: '28',
    correct: '3',
    a: [
      {
        aId: '1',
        atext: '12V'
      },
      {
        aId: '2',
        atext: '12～14V'
      },
      {
        aId: '3',
        atext: '5V'
      },
      {
        aId: '4',
        atext: '4.5～5.5V'
      }
    ]
  },
  {
    q: '未饱和气块上升时，引起它的温度变____，温度改变为每升高1000米____。',
    qId: '29',
    correct: '4',
    a: [
      {
        aId: '1',
        atext: '暖，10℃ '
      },
      {
        aId: '2',
        atext: '冷，6℃'
      },
      {
        aId: '3',
        atext: '暖，6℃'
      },
      {
        aId: '4',
        atext: '冷，10℃'
      }
    ]
  },
  {
    q: '温带气旋主要是在____发展起来的。',
    qId: '30',
    correct: '1',
    a: [
      {
        aId: '1',
        atext: '锋区 '
      },
      {
        aId: '2',
        atext: '暖区'
      },
      {
        aId: '3',
        atext: '冷区'
      }
    ]
  }
];
export default a;
